haitao9491/carrier_ipmc_keil/app/driver/lpc2400def/LPC2400.h
/*********************************************************************************************************
  Pin Connect Block
*********************************************************************************************************/

#define     PINSEL_BASE_ADDR	    0xE002C000

#define     PINSEL0                 (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x00))
#define     PINSEL1                 (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x04))
#define     PINSEL2                 (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x08))
#define     PINSEL3                 (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x0C))
#define     PINSEL4                 (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x10))
#define     PINSEL5                 (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x14))
#define     PINSEL6                 (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x18))
#define     PINSEL7                 (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x1C))
#define     PINSEL8                 (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x20))
#define     PINSEL9                 (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x24))
#define     PINSEL10                (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x28))

#define     PINMODE0                (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x40))            
#define     PINMODE1                (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x44))
#define     PINMODE2                (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x48))            
#define     PINMODE3                (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x4C))
#define     PINMODE4                (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x50))
#define     PINMODE5                (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x54))
#define     PINMODE6                (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x58))
#define     PINMODE7                (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x5C))
#define     PINMODE8                (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x60))
#define     PINMODE9                (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x64))

/*********************************************************************************************************
  General Purpose Input/Output (GPIO)
*********************************************************************************************************/

#define     GPIO_BASE_ADDR		    0xE0028000

#define     IO0PIN                  (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x00))
#define     IO0SET                  (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x04))
#define     IO0DIR                  (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x08))
#define     IO0CLR                  (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x0C))
#define     IO1PIN                  (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x10))
#define     IO1SET                  (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x14))
#define     IO1DIR                  (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x18))
#define     IO1CLR                  (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x1C))
/*********************************************************************************************************
  GPIO Interrupt Registers
*********************************************************************************************************/

#define     IO0IntEnR               (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x90)) 
#define     IO0IntEnF               (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x94))
#define     IO0IntStatR             (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x84))
#define     IO0IntStatF             (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x88))
#define     IO0IntClr               (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x8C))

#define     IO2IntEnR               (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0xB0)) 
#define     IO2IntEnF               (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0xB4))
#define     IO2IntStatR             (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0xA4))
#define     IO2IntStatF             (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0xA8))
#define     IO2IntClr               (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0xAC))

#define     IO_INT_STAT             (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x80))
#define     IOIntStatus             (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x80))

#define     PARTCFG_BASE_ADDR	    0x3FFF8000
#define     PARTCFG                 (*(volatile unsigned long *)(PARTCFG_BASE_ADDR + 0x00)) 
/*********************************************************************************************************
  Fast I/O setup
*********************************************************************************************************/

#define     FIO_BASE_ADDR		    0x3FFFC000

#define     FIO0DIR                 (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x00)) 
#define     FIO0MASK                (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x10))
#define     FIO0PIN                 (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x14))
#define     FIO0SET                 (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x18))
#define     FIO0CLR                 (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x1C))

#define     FIO1DIR                 (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x20)) 
#define     FIO1MASK                (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x30))
#define     FIO1PIN                 (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x34))
#define     FIO1SET                 (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x38))
#define     FIO1CLR                 (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x3C))

#define     FIO2DIR                 (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x40)) 
#define     FIO2MASK                (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x50))
#define     FIO2PIN                 (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x54))
#define     FIO2SET                 (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x58))
#define     FIO2CLR                 (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x5C))

#define     FIO3DIR                 (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x60)) 
#define     FIO3MASK                (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x70))
#define     FIO3PIN                 (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x74))
#define     FIO3SET                 (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x78))
#define     FIO3CLR                 (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x7C))

