haitao9491/carrier_ipmc_keil/app/driver/lpc2400def/LPC2400.h
#define     FIO0PIN3                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x17)) 
#define     FIO1PIN3                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x37)) 
#define     FIO2PIN3                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x57)) 
#define     FIO3PIN3                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x77)) 
#define     FIO4PIN3                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x97)) 

#define     FIO0PINL                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x14)) 
#define     FIO1PINL                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x34)) 
#define     FIO2PINL                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x54)) 
#define     FIO3PINL                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x74)) 
#define     FIO4PINL                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x94)) 

#define     FIO0PINU                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x16)) 
#define     FIO1PINU                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x36)) 
#define     FIO2PINU                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x56)) 
#define     FIO3PINU                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x76)) 
#define     FIO4PINU                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x96)) 

#define     FIO0SET0                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x18)) 
#define     FIO1SET0                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x38)) 
#define     FIO2SET0                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x58)) 
#define     FIO3SET0                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x78)) 
#define     FIO4SET0                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x98)) 

#define     FIO0SET1                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x19)) 
#define     FIO1SET1                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x39)) 
#define     FIO2SET1                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x59)) 
#define     FIO3SET1                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x79)) 
#define     FIO4SET1                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x99)) 

#define     FIO0SET2                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x1A)) 
#define     FIO1SET2                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x3A)) 
#define     FIO2SET2                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x5A)) 
#define     FIO3SET2                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x7A)) 
#define     FIO4SET2                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x9A)) 

#define     FIO0SET3                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x1B)) 
#define     FIO1SET3                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x3B)) 
#define     FIO2SET3                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x5B)) 
#define     FIO3SET3                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x7B)) 
#define     FIO4SET3                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x9B)) 

#define     FIO0SETL                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x18)) 
#define     FIO1SETL                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x38)) 
#define     FIO2SETL                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x58)) 
#define     FIO3SETL                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x78)) 
#define     FIO4SETL                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x98)) 

#define     FIO0SETU                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x1A)) 
#define     FIO1SETU                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x3A)) 
#define     FIO2SETU                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x5A)) 
#define     FIO3SETU                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x7A)) 
#define     FIO4SETU                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x9A)) 

#define     FIO0CLR0                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x1C)) 
#define     FIO1CLR0                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x3C)) 
#define     FIO2CLR0                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x5C)) 
#define     FIO3CLR0                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x7C)) 
#define     FIO4CLR0                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x9C)) 

#define     FIO0CLR1                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x1D)) 
#define     FIO1CLR1                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x3D)) 
#define     FIO2CLR1                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x5D)) 
#define     FIO3CLR1                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x7D)) 
#define     FIO4CLR1                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x9D)) 

#define     FIO0CLR2                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x1E)) 
#define     FIO1CLR2                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x3E)) 
#define     FIO2CLR2                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x5E)) 
#define     FIO3CLR2                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x7E)) 
#define     FIO4CLR2                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x9E)) 

#define     FIO0CLR3                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x1F)) 
#define     FIO1CLR3                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x3F)) 
#define     FIO2CLR3                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x5F)) 
#define     FIO3CLR3                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x7F)) 
#define     FIO4CLR3                (*(volatile unsigned char *)(FIO_BASE_ADDR + 0x9F)) 

#define     FIO0CLRL                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x1C)) 
#define     FIO1CLRL                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x3C)) 
#define     FIO2CLRL                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x5C)) 
#define     FIO3CLRL                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x7C)) 
#define     FIO4CLRL                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x9C)) 

