haitao9491/carrier_ipmc_keil/app/driver/lpc2400def/LPC2400.h
#define     FIO0CLRU                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x1E)) 
#define     FIO1CLRU                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x3E)) 
#define     FIO2CLRU                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x5E)) 
#define     FIO3CLRU                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x7E)) 
#define     FIO4CLRU                (*(volatile unsigned short *)(FIO_BASE_ADDR + 0x9E)) 

/*********************************************************************************************************
   System Control Block(SCB) modules include Memory Accelerator Module,
   Phase Locked Loop, VPB divider, Power Control, External Interrupt, 
   Reset, and Code Security/Debugging 
*********************************************************************************************************/

#define     SCB_BASE_ADDR	        0xE01FC000
/*********************************************************************************************************
  Memory Accelerator Module 
*********************************************************************************************************/

#define     MAMCR                   (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x000))
#define     MAMTIM                  (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x004))
#define     MEMMAP                  (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x040))

/*********************************************************************************************************
  Phase Locked Loop (PLL)
*********************************************************************************************************/

#define     PLLCON                  (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x080))
#define     PLLCFG                  (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x084))
#define     PLLSTAT                 (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x088))
#define     PLLFEED                 (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x08C))

/*********************************************************************************************************
  Power Control
*********************************************************************************************************/

#define     PCON                    (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x0C0))
#define     PCONP                   (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x0C4))

/*********************************************************************************************************
  Clock Divider
*********************************************************************************************************/

#define     CCLKCFG                 (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x104))
#define     USBCLKCFG               (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x108))
#define     CLKSRCSEL               (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x10C))
#define     PCLKSEL0                (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x1A8))
#define     PCLKSEL1                (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x1AC))

/*********************************************************************************************************
  External Interrupts
*********************************************************************************************************/
	
#define     EXTINT                  (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x140))
#define     INTWAKE                 (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x144))
#define     EXTMODE                 (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x148))
#define     EXTPOLAR                (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x14C))
/*********************************************************************************************************
  Reset, reset source identification
*********************************************************************************************************/

#define     RSIR                    (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x180))
/*********************************************************************************************************
  RSID, code security protection
*********************************************************************************************************/

#define     CSPR                    (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x184))

#define     AHBCFG1                 (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x188))
#define     AHBCFG2                 (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x18C))

#define     SCS                     (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x1A0))	

#define     EMC_BASE_ADDR		    0xFFE08000
#define     EMCControl			    (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x000))
#define     EMCStatus			    (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x004))
#define     EMCConfig			    (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x008))

#define     EMCDynamicControl	    (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x020))
#define     EMCDynamicRefresh	    (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x024))
#define     EMCDynamicReadConfig    (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x028))
#define     EMCDynamictRP    		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x030))
#define     EMCDynamictRAS  		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x034))
#define     EMCDynamictSREX 		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x038))
#define     EMCDynamictAPR   		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x03C))
#define     EMCDynamictDAL  		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x040))
#define     EMCDynamictWR   		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x044))
#define     EMCDynamictRC   		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x048))
#define     EMCDynamictRFC  		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x04C))
#define     EMCDynamictXSR  		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x050))
#define     EMCDynamictRRD  		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x054))
#define     EMCDynamictMRD  		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x058))

