haitao9491/carrier_ipmc_keil/app/driver/lpc2400def/LPC2400.h
#define     EMCDynamicConfig0		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x100))
#define     EMCDynamicContro1		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x120))
#define     EMCDynamicContro2		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x140))
#define     EMCDynamicContro3		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x160))

#define     EMCDynamicRASCAS0		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x104))
#define     EMCDynamicRASCAS1		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x124))
#define     EMCDynamicRASCAS2		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x144))
#define     EMCDynamicRASCAS3		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x164))

#define     EMCStaticConfig0		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x200))
#define     EMCStaticWaitWen0		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x204))
#define     EMCStaticWaitOen0		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x208))
#define     EMCStaticWaitRd0		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x20C))
#define     EMCStaticWaitPage0		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x210))
#define     EMCStaticWaitWr0		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x214))
#define     EMCStaticWaitTurn0		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x218))

#define     EMCStaticConfig1		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x220))
#define     EMCStaticWaitWen1		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x224))
#define     EMCStaticWaitOen1		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x228))
#define     EMCStaticWaitRd1		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x22C))
#define     EMCStaticWaitPage1		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x230))
#define     EMCStaticWaitWr1		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x234))
#define     EMCStaticWaitTurn1		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x238))

#define     EMCStaticConfig2		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x240))
#define     EMCStaticWaitWen2		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x244))
#define     EMCStaticWaitOen2		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x248))
#define     EMCStaticWaitRd2		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x24C))
#define     EMCStaticWaitPage2		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x250))
#define     EMCStaticWaitWr2		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x254))
#define     EMCStaticWaitTurn2		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x258))

#define     EMCStaticConfig3		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x260))
#define     EMCStaticWaitWen3		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x264))
#define     EMCStaticWaitOen3		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x268))
#define     EMCStaticWaitRd3		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x26C))
#define     EMCStaticWaitPage3		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x270))
#define     EMCStaticWaitWr3		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x274))
#define     EMCStaticWaitTurn3		(*(volatile unsigned long *)(EMC_BASE_ADDR + 0x278))

#define     EMCStaticExtendedWait   (*(volatile unsigned long *)(EMC_BASE_ADDR + 0x880))	

#define     TMR0_BASE_ADDR		    0xE0004000

#define     T0IR                    (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x00))
#define     T0TCR                   (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x04))
#define     T0TC                    (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x08))
#define     T0PR                    (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x0C))
#define     T0PC                    (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x10))
#define     T0MCR                   (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x14))
#define     T0MR0                   (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x18))
#define     T0MR1                   (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x1C))
#define     T0MR2                   (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x20))
#define     T0MR3                   (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x24))
#define     T0CCR                   (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x28))
#define     T0CR0                   (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x2C))
#define     T0CR1                   (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x30))
#define     T0CR2                   (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x34))
#define     T0CR3                   (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x38))
#define     T0EMR                   (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x3C))
#define     T0CTCR                  (*(volatile unsigned long *)(TMR0_BASE_ADDR + 0x70))

#define     TMR1_BASE_ADDR		    0xE0008000

#define     T1IR                    (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x00))
#define     T1TCR                   (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x04))
#define     T1TC                    (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x08))
#define     T1PR                    (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x0C))
#define     T1PC                    (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x10))
#define     T1MCR                   (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x14))
#define     T1MR0                   (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x18))
#define     T1MR1                   (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x1C))
#define     T1MR2                   (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x20))
#define     T1MR3                   (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x24))
#define     T1CCR                   (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x28))
#define     T1CR0                   (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x2C))
#define     T1CR1                   (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x30))
#define     T1CR2                   (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x34))
#define     T1CR3                   (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x38))
#define     T1EMR                   (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x3C))
#define     T1CTCR                  (*(volatile unsigned long *)(TMR1_BASE_ADDR + 0x70))

#define     TMR2_BASE_ADDR		    0xE0070000

#define     T2IR                    (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x00))
#define     T2TCR                   (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x04))
#define     T2TC                    (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x08))
#define     T2PR                    (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x0C))
#define     T2PC                    (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x10))
#define     T2MCR                   (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x14))
#define     T2MR0                   (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x18))
#define     T2MR1                   (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x1C))
#define     T2MR2                   (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x20))
#define     T2MR3                   (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x24))
#define     T2CCR                   (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x28))
#define     T2CR0                   (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x2C))
#define     T2CR1                   (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x30))
#define     T2CR2                   (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x34))
#define     T2CR3                   (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x38))
#define     T2EMR                   (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x3C))
#define     T2CTCR                  (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x70))

#define     TMR3_BASE_ADDR		    0xE0074000

#define     T3IR                    (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x00))
#define     T3TCR                   (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x04))
#define     T3TC                    (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x08))
#define     T3PR                    (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x0C))
#define     T3PC                    (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x10))
#define     T3MCR                   (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x14))
#define     T3MR0                   (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x18))
#define     T3MR1                   (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x1C))
#define     T3MR2                   (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x20))
#define     T3MR3                   (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x24))
#define     T3CCR                   (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x28))
#define     T3CR0                   (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x2C))
#define     T3CR1                   (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x30))
#define     T3CR2                   (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x34))
#define     T3CR3                   (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x38))
#define     T3EMR                   (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x3C))
#define     T3CTCR                  (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x70))


