haitao9491/carrier_ipmc_keil/app/driver/lpc2400def/LPC2400.h
/*
#define     PWM0_BASE_ADDR		    0xE0014000
#define     PWM0IR                  (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x00))
#define     PWM0TCR                 (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x04))
#define     PWM0TC                  (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x08))
#define     PWM0PR                  (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x0C))
#define     PWM0PC                  (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x10))
#define     PWM0MCR                 (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x14))
#define     PWM0MR0                 (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x18))
#define     PWM0MR1                 (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x1C))
#define     PWM0MR2                 (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x20))
#define     PWM0MR3                 (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x24))
#define     PWM0CCR                 (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x28))
#define     PWM0CR0                 (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x2C))
#define     PWM0CR1                 (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x30))
#define     PWM0CR2                 (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x34))
#define     PWM0CR3                 (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x38))
#define     PWM0EMR                 (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x3C))
#define     PWM0MR4                 (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x40))
#define     PWM0MR5                 (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x44))
#define     PWM0MR6                 (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x48))
#define     PWM0PCR                 (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x4C))
#define     PWM0LER                 (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x50))
#define     PWM0CTCR                (*(volatile unsigned long *)(PWM0_BASE_ADDR + 0x70))
*/
#define     PWM1_BASE_ADDR		    0xE0018000

#define     PWM1IR                  (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x00))
#define     PWM1TCR                 (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x04))
#define     PWM1TC                  (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x08))
#define     PWM1PR                  (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x0C))
#define     PWM1PC                  (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x10))
#define     PWM1MCR                 (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x14))
#define     PWM1MR0                 (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x18))
#define     PWM1MR1                 (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x1C))
#define     PWM1MR2                 (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x20))
#define     PWM1MR3                 (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x24))
#define     PWM1CCR                 (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x28))
#define     PWM1CR0                 (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x2C))
#define     PWM1CR1                 (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x30))
#define     PWM1CR2                 (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x34))
#define     PWM1CR3                 (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x38))
#define     PWM1EMR                 (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x3C))
#define     PWM1MR4                 (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x40))
#define     PWM1MR5                 (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x44))
#define     PWM1MR6                 (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x48))
#define     PWM1PCR                 (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x4C))
#define     PWM1LER                 (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x50))
#define     PWM1CTCR                (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x70))

#define     UART0_BASE_ADDR		    0xE000C000

#define     U0RBR                   (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x00))
#define     U0THR                   (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x00))
#define     U0DLL                   (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x00))
#define     U0DLM                   (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x04))
#define     U0IER                   (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x04))
#define     U0IIR                   (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x08))
#define     U0FCR                   (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x08))
#define     U0LCR                   (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x0C))

#define     U0LSR                   (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x14))
#define     U0SCR                   (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x1C))
#define     U0ACR                   (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x20))

#define     U0FDR                   (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x28))
#define     U0TER                   (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x30))

#define     UART1_BASE_ADDR		    0xE0010000

#define     U1RBR                   (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x00))
#define     U1THR                   (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x00))
#define     U1DLL                   (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x00))
#define     U1DLM                   (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x04))
#define     U1IER                   (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x04))
#define     U1IIR                   (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x08))
#define     U1FCR                   (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x08))
#define     U1LCR                   (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x0C))
#define     U1MCR                   (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x10))
#define     U1LSR                   (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x14))
#define     U1MSR                   (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x18))
#define     U1SCR                   (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x1C))
#define     U1ACR                   (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x20))

#define     U1FDR                   (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x28))
#define     U1TER                   (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x30))

#define     UART2_BASE_ADDR		    0xE0078000

#define     U2RBR                   (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x00))
#define     U2THR                   (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x00))
#define     U2DLL                   (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x00))
#define     U2DLM                   (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x04))
#define     U2IER                   (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x04))
#define     U2IIR                   (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x08))
#define     U2FCR                   (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x08))
#define     U2LCR                   (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x0C))

#define     U2LSR                   (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x14))
#define     U2SCR                   (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x1C))
#define     U2ACR                   (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x20))

#define     U2FDR                   (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x28))
#define     U2TER                   (*(volatile unsigned long *)(UART2_BASE_ADDR + 0x30))

#define     UART3_BASE_ADDR		    0xE007C000

#define     U3RBR                   (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x00))
#define     U3THR                   (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x00))
#define     U3DLL                   (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x00))
#define     U3DLM                   (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x04))
#define     U3IER                   (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x04))
#define     U3IIR                   (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x08))
#define     U3FCR                   (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x08))
#define     U3LCR                   (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x0C))

#define     U3LSR                   (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x14))
#define     U3SCR                   (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x1C))
#define     U3ACR                   (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x20))
#define     U3ICR                   (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x24))
#define     U3FDR                   (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x28))
#define     U3TER                   (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x30))

#define     I2C_BASE_ADDR		    0xE001C000

#define     I2CONSET                (*(volatile unsigned long *)(I2C_BASE_ADDR + 0x00))
#define     I2STAT                  (*(volatile unsigned long *)(I2C_BASE_ADDR + 0x04))
#define     I2DAT                   (*(volatile unsigned long *)(I2C_BASE_ADDR + 0x08))
#define     I2ADR                   (*(volatile unsigned long *)(I2C_BASE_ADDR + 0x0C))
#define     I2SCLH                  (*(volatile unsigned long *)(I2C_BASE_ADDR + 0x10))
#define     I2SCLL                  (*(volatile unsigned long *)(I2C_BASE_ADDR + 0x14))
#define     I2CONCLR                (*(volatile unsigned long *)(I2C_BASE_ADDR + 0x18))

#define     I2C0_BASE_ADDR		    0xE001C000

#define     I20CONSET               (*(volatile unsigned long *)(I2C0_BASE_ADDR + 0x00))
#define     I20STAT                 (*(volatile unsigned long *)(I2C0_BASE_ADDR + 0x04))
#define     I20DAT                  (*(volatile unsigned long *)(I2C0_BASE_ADDR + 0x08))
#define     I20ADR                  (*(volatile unsigned long *)(I2C0_BASE_ADDR + 0x0C))
#define     I20SCLH                 (*(volatile unsigned long *)(I2C0_BASE_ADDR + 0x10))
#define     I20SCLL                 (*(volatile unsigned long *)(I2C0_BASE_ADDR + 0x14))
#define     I20CONCLR               (*(volatile unsigned long *)(I2C0_BASE_ADDR + 0x18))

