haitao9491/carrier_ipmc_keil/app/driver/lpc2400def/LPC2400.h
#define     DACR                    (*(volatile unsigned long *)(DAC_BASE_ADDR + 0x00))

#define     WDG_BASE_ADDR		    0xE0000000

#define     WDMOD                   (*(volatile unsigned long *)(WDG_BASE_ADDR + 0x00))
#define     WDTC                    (*(volatile unsigned long *)(WDG_BASE_ADDR + 0x04))
#define     WDFEED                  (*(volatile unsigned long *)(WDG_BASE_ADDR + 0x08))
#define     WDTV                    (*(volatile unsigned long *)(WDG_BASE_ADDR + 0x0C))
#define     WDCLKSEL                (*(volatile unsigned long *)(WDG_BASE_ADDR + 0x10))

#define     CAN_ACCEPT_BASE_ADDR	0xE003C000

#define     CAN_AFMR 			    (*(volatile unsigned long *)(CAN_ACCEPT_BASE_ADDR + 0x00))  	
#define     CAN_SFF_SA 			    (*(volatile unsigned long *)(CAN_ACCEPT_BASE_ADDR + 0x04))  	
#define     CAN_SFF_GRP_SA 		    (*(volatile unsigned long *)(CAN_ACCEPT_BASE_ADDR + 0x08))
#define     CAN_EFF_SA 			    (*(volatile unsigned long *)(CAN_ACCEPT_BASE_ADDR + 0x0C))
#define     CAN_EFF_GRP_SA 		    (*(volatile unsigned long *)(CAN_ACCEPT_BASE_ADDR + 0x10))  	
#define     CAN_EOT 			    (*(volatile unsigned long *)(CAN_ACCEPT_BASE_ADDR + 0x14))
#define     CAN_LUT_ERR_ADR		    (*(volatile unsigned long *)(CAN_ACCEPT_BASE_ADDR + 0x18))  	
#define     CAN_LUT_ERR 		    (*(volatile unsigned long *)(CAN_ACCEPT_BASE_ADDR + 0x1C))

#define     CAN_CENTRAL_BASE_ADDR	0xE0040000  
    	
#define     CAN_TX_SR 			    (*(volatile unsigned long *)(CAN_CENTRAL_BASE_ADDR + 0x00))  	
#define     CAN_RX_SR 			    (*(volatile unsigned long *)(CAN_CENTRAL_BASE_ADDR + 0x04))  	
#define     CAN_MSR 			    (*(volatile unsigned long *)(CAN_CENTRAL_BASE_ADDR + 0x08))

#define     CAN1_BASE_ADDR		    0xE0044000

#define     CAN1MOD 	            (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x00))  	
#define     CAN1CMR 	            (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x04))  	
#define     CAN1GSR         	    (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x08))  	
#define     CAN1ICR 	            (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x0C))  	
#define     CAN1IER 	            (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x10))
#define     CAN1BTR 	            (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x14))  	
#define     CAN1EWL 	            (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x18))  	
#define     CAN1SR 		            (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x1C))  	
#define     CAN1RFS 	            (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x20))  	
#define     CAN1RID 	            (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x24))
#define     CAN1RDA         	    (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x28))  	
#define     CAN1RDB         	    (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x2C))
  	
#define     CAN1TFI1         	    (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x30))  	
#define     CAN1TID1         	    (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x34))  	
#define     CAN1TDA1         	    (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x38))
#define     CAN1TDB1         	    (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x3C))  	
#define     CAN1TFI2         	    (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x40))  	
#define     CAN1TID2 	            (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x44))  	
#define     CAN1TDA2 	            (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x48))  	
#define     CAN1TDB2 	            (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x4C))
#define     CAN1TFI3         	    (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x50))  	
#define     CAN1TID3         	    (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x54))  	
#define     CAN1TDA3         	    (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x58))  	
#define     CAN1TDB3 	            (*(volatile unsigned long *)(CAN1_BASE_ADDR + 0x5C))

#define     CAN2_BASE_ADDR		    0xE0048000

#define     CAN2MOD 	            (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x00))  	
#define     CAN2CMR 	            (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x04))  	
#define     CAN2GSR 	            (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x08))  	
#define     CAN2ICR 	            (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x0C))  	
#define     CAN2IER 	            (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x10))
#define     CAN2BTR 	            (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x14))  	
#define     CAN2EWL                 (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x18))  	
#define     CAN2SR 		            (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x1C))  	
#define     CAN2RFS 	            (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x20))  	
#define     CAN2RID 	            (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x24))
#define     CAN2RDA 	            (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x28))  	
#define     CAN2RDB 	            (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x2C))
              	
#define     CAN2TFI1 	            (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x30))  	
#define     CAN2TID1 	            (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x34))  	
#define     CAN2TDA1 	            (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x38))
#define     CAN2TDB1 	            (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x3C))  	
#define     CAN2TFI2 	            (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x40))  	
#define     CAN2TID2 	            (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x44))  	
#define     CAN2TDA2 	            (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x48))  	
#define     CAN2TDB2 	            (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x4C))
#define     CAN2TFI3 	            (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x50))  	
#define     CAN2TID3 	            (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x54))  	
#define     CAN2TDA3 	            (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x58))  	
#define     CAN2TDB3 	            (*(volatile unsigned long *)(CAN2_BASE_ADDR + 0x5C))

#define     MCI_BASE_ADDR		    0xE008C000

