haitao9491/carrier_ipmc_keil/app/driver/lpc2400def/LPC2400.h
#define     MCIPower                (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x00))
#define     MCIClock                (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x04))
#define     MCIArgument             (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x08))
#define     MCICommand              (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x0C))
#define     MCIRespCmd              (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x10))
#define     MCIResponse0            (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x14))
#define     MCIResponse1            (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x18))
#define     MCIResponse2            (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x1C))
#define     MCIResponse3            (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x20))
#define     MCIDataTimer            (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x24))
#define     MCIDataLength           (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x28))
#define     MCIDataCtrl             (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x2C))
#define     MCIDataCnt              (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x30))
#define     MCIStatus               (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x34))
#define     MCIClear                (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x38))
#define     MCIMask0                (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x3C))
#define     MCIMask1                (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x40))
#define     MCIFifoCnt              (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x48))
#define     MCIFIFO                 (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x80))

#define     I2S_BASE_ADDR		    0xE0088000

#define     I2SDAO                  (*(volatile unsigned long *)(I2S_BASE_ADDR + 0x00))
#define     I2SDAI                  (*(volatile unsigned long *)(I2S_BASE_ADDR + 0x04))
#define     I2STXFIFO               (*(volatile unsigned long *)(I2S_BASE_ADDR + 0x08))
#define     I2SRXFIFO               (*(volatile unsigned long *)(I2S_BASE_ADDR + 0x0C))
#define     I2SSTATE                (*(volatile unsigned long *)(I2S_BASE_ADDR + 0x10))
#define     I2SDMA1                 (*(volatile unsigned long *)(I2S_BASE_ADDR + 0x14))
#define     I2SDMA2                 (*(volatile unsigned long *)(I2S_BASE_ADDR + 0x18))
#define     I2SIRQ                  (*(volatile unsigned long *)(I2S_BASE_ADDR + 0x1C))
#define     I2STXRATE               (*(volatile unsigned long *)(I2S_BASE_ADDR + 0x20))
#define     I2SRXRATE               (*(volatile unsigned long *)(I2S_BASE_ADDR + 0x24))

#define     DMA_BASE_ADDR		    0xFFE04000

#define     DMACIntStatus           (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x000))
#define     DMACIntTCStatus         (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x004))
#define     DMACIntTCClear          (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x008))
#define     DMACIntErrorStatus      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x00C))
#define     DMACIntErrClr           (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x010))
#define     DMACRawIntTCStatus      (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x014))
#define     DMACRawIntErrorStatus   (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x018))
#define     DMACEnbldChns           (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x01C))
#define     DMACSoftBReq            (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x020))
#define     DMACSoftSReq            (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x024))
#define     DMACSoftLBReq           (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x028))
#define     DMACSoftLSReq           (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x02C))
#define     DMACConfiguration       (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x030))
#define     DMACSync                (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x034))

#define     DMACC0SrcAddr           (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x100))
#define     DMACC0DestAddr          (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x104))
#define     DMACC0LLI               (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x108))
#define     DMACC0Control           (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x10C))
#define     DMACC0Configuration     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x110))

#define     DMACC1SrcAddr           (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x120))
#define     DMACC1DestAddr          (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x124))
#define     DMACC1LLI               (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x128))
#define     DMACC1Control           (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x12C))
#define     DMACC1Configuration     (*(volatile unsigned long *)(DMA_BASE_ADDR + 0x130))


#define     USB_INT_BASE_ADDR	    0xE01FC1C0
#define     USB_BASE_ADDR		    0xFFE0C200	

#define      USBClkCtrl            	(*(volatile unsigned long *)(0xFFE0CFF4))  
#define      USBClkSt              	(*(volatile unsigned long *)(0xFFE0CFF8)) 
#define      USBPortSel            	(*(volatile unsigned long *)(0xFFE0C110))	


#define     USBIntSt			    (*(volatile unsigned long *)(USB_INT_BASE_ADDR + 0x00))

#define     USBDevIntSt			    (*(volatile unsigned long *)(USB_BASE_ADDR + 0x00))
#define     USBDevIntEn			    (*(volatile unsigned long *)(USB_BASE_ADDR + 0x04))
#define     USBDevIntClr		    (*(volatile unsigned long *)(USB_BASE_ADDR + 0x08))
#define     USBDevIntSet		    (*(volatile unsigned long *)(USB_BASE_ADDR + 0x0C))
#define     USBDevIntPri		    (*(volatile unsigned long *)(USB_BASE_ADDR + 0x2C))

#define     USBEpIntSt			    (*(volatile unsigned long *)(USB_BASE_ADDR + 0x30))
#define     USBEpIntEn			    (*(volatile unsigned long *)(USB_BASE_ADDR + 0x34))
#define     USBEpIntClr			    (*(volatile unsigned long *)(USB_BASE_ADDR + 0x38))
#define     USBEpIntSet			    (*(volatile unsigned long *)(USB_BASE_ADDR + 0x3C))
#define     USBEpIntPri			    (*(volatile unsigned long *)(USB_BASE_ADDR + 0x40))

#define     USBReEp				    (*(volatile unsigned long *)(USB_BASE_ADDR + 0x44))
#define     USBEpInd			    (*(volatile unsigned long *)(USB_BASE_ADDR + 0x48))
#define     USBMaxPSize			    (*(volatile unsigned long *)(USB_BASE_ADDR + 0x4C))

#define     USBCmdCode			    (*(volatile unsigned long *)(USB_BASE_ADDR + 0x10))
#define     USBCmdData			    (*(volatile unsigned long *)(USB_BASE_ADDR + 0x14))

#define     USBRxData			    (*(volatile unsigned long *)(USB_BASE_ADDR + 0x18))
#define     USBTxData			    (*(volatile unsigned long *)(USB_BASE_ADDR + 0x1C))
#define     USBRxPLen			    (*(volatile unsigned long *)(USB_BASE_ADDR + 0x20))
#define     USBTxPLen			    (*(volatile unsigned long *)(USB_BASE_ADDR + 0x24))
#define     USBCtrl				    (*(volatile unsigned long *)(USB_BASE_ADDR + 0x28))

#define     USBDMARSt               (*(volatile unsigned long *)(USB_BASE_ADDR + 0x50))
#define     USBDMARClr              (*(volatile unsigned long *)(USB_BASE_ADDR + 0x54))
#define     USBDMARSet              (*(volatile unsigned long *)(USB_BASE_ADDR + 0x58))
#define     USBUDCAH                (*(volatile unsigned long *)(USB_BASE_ADDR + 0x80))
#define     USBEpDMASt              (*(volatile unsigned long *)(USB_BASE_ADDR + 0x84))
#define     USBEpDMAEn              (*(volatile unsigned long *)(USB_BASE_ADDR + 0x88))
#define     USBEpDMADis             (*(volatile unsigned long *)(USB_BASE_ADDR + 0x8C))
#define     USBDMAIntSt             (*(volatile unsigned long *)(USB_BASE_ADDR + 0x90))
#define     USBDMAIntEn             (*(volatile unsigned long *)(USB_BASE_ADDR + 0x94))
#define     USBEoTIntSt             (*(volatile unsigned long *)(USB_BASE_ADDR + 0xA0))
#define     USBEoTIntClr            (*(volatile unsigned long *)(USB_BASE_ADDR + 0xA4))
#define     USBEoTIntSet            (*(volatile unsigned long *)(USB_BASE_ADDR + 0xA8))
#define     USBNDDRIntSt            (*(volatile unsigned long *)(USB_BASE_ADDR + 0xAC))
#define     USBNDDRIntClr           (*(volatile unsigned long *)(USB_BASE_ADDR + 0xB0))
#define     USBNDDRIntSet           (*(volatile unsigned long *)(USB_BASE_ADDR + 0xB4))
#define     USBSysErrIntSt          (*(volatile unsigned long *)(USB_BASE_ADDR + 0xB8))
#define     USBSysErrIntClr         (*(volatile unsigned long *)(USB_BASE_ADDR + 0xBC))
#define     USBSysErrIntSet         (*(volatile unsigned long *)(USB_BASE_ADDR + 0xC0))

#define     USBHC_BASE_ADDR		    0xFFE0C000

#define     HcRevision              (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x00))
#define     HcControl               (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x04))
#define     HcCommandStatus         (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x08))
#define     HcInterruptStatus       (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x0C))
#define     HcInterruptEnable       (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x10))
#define     HcInterruptDisable      (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x14))
#define     HcHcca                  (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x18))
#define     HcPeriodCurrentED       (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x1C))
#define     HcControlHeadED         (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x20))
#define     HcControlCurrentED      (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x24))
#define     HcBulkHeadED            (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x28))
#define     HcBulkCurrentED         (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x2C))
#define     HcDoneHead              (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x30))
#define     HcFmInterval            (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x34))
#define     HcFmRemaining           (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x38))
#define     HcFmNumber              (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x3C))
#define     HcPeriodicStart         (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x40))
#define     HcLSThreshold           (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x44))
#define     HcRhDescriptorA         (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x48))
#define     HcRhDescriptorB         (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x4C))
#define     HcRhStatus              (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x50))
#define     HcRhPortStatus1         (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x54))
#define     HcRhPortStatus2         (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0x58))
#define     Module_VerRev_ID        (*(volatile unsigned long *)(USBHC_BASE_ADDR + 0xFC))

#define     USBOTG_BASE_ADDR	    0xFFE0C100

#define     OTGIntSt                (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x00))
#define     OTGIntEn                (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x04))
#define     OTGIntSet               (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x08))
#define     OTGIntClr               (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x0C))

#define     OTGStCtrl               (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x10))
#define     OTGTmr                  (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x14))

#define     USBOTG_I2C_BASE_ADDR	0xFFE0C300

