haitao9491/carrier_ipmc_keil/app/driver/lpc2400def/LPC2400.h
#define     I2C_RX                  (*(volatile unsigned long *)(USBOTG_I2C_BASE_ADDR + 0x00))
#define     I2C_TX                  (*(volatile unsigned long *)(USBOTG_I2C_BASE_ADDR + 0x00))
#define     I2C_STS                 (*(volatile unsigned long *)(USBOTG_I2C_BASE_ADDR + 0x04))
#define     I2C_CTL                 (*(volatile unsigned long *)(USBOTG_I2C_BASE_ADDR + 0x08))
#define     I2C_CLKHI               (*(volatile unsigned long *)(USBOTG_I2C_BASE_ADDR + 0x0C))
#define     I2C_CLKLO               (*(volatile unsigned long *)(USBOTG_I2C_BASE_ADDR + 0x10))

#define     USBOTG_CLK_BASE_ADDR	0xFFE0CFF0
#define     OTGClkCtrl              (*(volatile unsigned long *)(USBOTG_CLK_BASE_ADDR + 0x04))
#define     OTGClkSt                (*(volatile unsigned long *)(USBOTG_CLK_BASE_ADDR + 0x08))


#define     MAC_BASE_ADDR		    0xFFE00000 

#define     MAC_MAC1                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x000)) 
#define     MAC_MAC2                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x004)) 
#define     MAC_IPGT                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x008)) 
#define     MAC_IPGR                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x00C))
#define     MAC_CLRT                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x010))
#define     MAC_MAXF                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x014))
#define     MAC_SUPP                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x018))
#define     MAC_TEST                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x01C))
#define     MAC_MCFG                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x020))
#define     MAC_MCMD                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x024))
#define     MAC_MADR                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x028))
#define     MAC_MWTD                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x02C))
#define     MAC_MRDD                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x030))
#define     MAC_MIND                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x034))

#define     MAC_SA0                 (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x040)) 
#define     MAC_SA1                 (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x044)) 
#define     MAC_SA2                 (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x048)) 

#define     MAC_COMMAND             (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x100)) 
#define     MAC_STATUS              (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x104)) 
#define     MAC_RXDESCRIPTOR        (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x108)) 
#define     MAC_RXSTATUS            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x10C)) 
#define     MAC_RXDESCRIPTORNUM     (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x110)) 
#define     MAC_RXPRODUCEINDEX      (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x114)) 
#define     MAC_RXCONSUMEINDEX      (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x118)) 
#define     MAC_TXDESCRIPTOR        (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x11C)) 
#define     MAC_TXSTATUS            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x120)) 
#define     MAC_TXDESCRIPTORNUM     (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x124)) 
#define     MAC_TXPRODUCEINDEX      (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x128)) 
#define     MAC_TXCONSUMEINDEX      (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x12C)) 

#define     MAC_TSV0                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x158)) 
#define     MAC_TSV1                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x15C)) 
#define     MAC_RSV                 (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x160)) 

#define     MAC_FLOWCONTROLCNT      (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x170)) 
#define     MAC_FLOWCONTROLSTS      (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x174)) 

#define     MAC_RXFILTERCTRL        (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x200))
#define     MAC_RXFILTERWOLSTS      (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x204))
#define     MAC_RXFILTERWOLCLR      (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x208))

#define     MAC_HASHFILTERL         (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x210))
#define     MAC_HASHFILTERH         (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x214))

#define     MAC_INTSTATUS           (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFE0))
#define     MAC_INTENABLE           (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFE4))
#define     MAC_INTCLEAR            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFE8))
#define     MAC_INTSET              (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFEC))

#define     MAC_POWERDOWN           (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFF4))
#define     MAC_MODULEID            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFFC))

#define     rm_init_entry()             ((void (*)())(0x7fffff91))()
#define     rm_undef_handler()          ((void (*)())(0x7fffffa0))()
#define     rm_prefetchabort_handler()  ((void (*)())(0x7fffffb0))()
#define     rm_dataabort_handler()      ((void (*)())(0x7fffffc0))()
#define     rm_irqhandler()             ((void (*)())(0x7fffffd0))()
#define     rm_irqhandler2()            ((void (*)())(0x7fffffe0))()
#define     iap_entry(a, b)             ((void (*)())(0x7ffffff1))(a, b)
#endif                                                                  /*  __LPC24XX_H_                */

/*********************************************************************************************************
**                            End Of File
*********************************************************************************************************/
